# ðŸŽ¬ MOVIES IN SQL

In [58]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [59]:
df = pd.read_csv("data/data.csv")

In [63]:
# database connection
hostname="127.0.0.1"
dbname="hello_movies"
uname="root"
pwd="pixel"

# create SQLAlchemy engine to connect to MySQL Database
engine = create_engine("mysql+pymysql://{user}:{pw}@{host}/{db}".format(host=hostname, db=dbname, user=uname, pw=pwd))

# connect to the database
engine.connect()

In [64]:
# upload dataframe in SQL base
df.to_sql('hello_movies', engine, index=False)

In [55]:
# connect to MySQL
connection = engine.connect()

In [ ]:
# replace some values
sql1 = pd.read_sql(
    "REPLACE INTO hellomovies.hellomovies (title, year_of_release, duration_in_minutes, genre) VALUES ('Coco', 2017, 105, 'Animation, Adventure, Comedy');", con=connection)

In [80]:
# check the count of movies by year (1921 > 2021)
sql2 = pd.read_sql(
    "SELECT year_of_release, COUNT(title) AS 'Count' FROM hello_movies.hello_movies GROUP BY year_of_release;", con=connection)
sql1

    year_of_release  Count
0              1994      6
1              1972      1
2              2008      3
3              1974      2
4              1957      7
..              ...    ...
81             1949      1
82             1939      2
83             1934      1
84             1928      1
85             1926      1

[86 rows x 2 columns]

In [84]:
# average audience score from rotten tomatoes for all 250 movies
sql3 = pd.read_sql(
    "SELECT AVG(audience_score_x) AS 'AVG Audience score RT' FROM hello_movies.hello_movies;", con=connection)
sql3

   AVG Audience score RT
0              69.991597